shyamnexus/ESP_HMI/sdkconfig.defaults
# ============================================================
# Target
# ============================================================
CONFIG_IDF_TARGET="esp32s3"

# ============================================================
# Flash
# ============================================================
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ============================================================
# PSRAM (OPI 8MB on ESP32-S3)
# ============================================================
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y

# ============================================================
# CPU
# ============================================================
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y

# ============================================================
# FreeRTOS
# ============================================================
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# ============================================================
# Logging
# ============================================================
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# ============================================================
# Wi-Fi
# ============================================================
CONFIG_ESP32_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP32_WIFI_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_ESP32_WIFI_DYNAMIC_TX_BUFFER=y
CONFIG_ESP32_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP32_WIFI_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_ESP32_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP32_WIFI_AMPDU_RX_ENABLED=y

# ============================================================
# Compiler
# ============================================================
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# ============================================================
# NVS encryption (disabled for simplicity; enable in production)
# ============================================================
CONFIG_NVS_ENCRYPTION=n

# ============================================================
# LVGL - configured via idf_component.yml / managed components
# ============================================================
CONFIG_LV_COLOR_DEPTH=16

# Fonts used in the HMI (enable all three sizes)
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y
